from aiogram import Router
from aiogram.filters import CommandStart
from aiogram.types import Message

from db.crud import is_student_in_db

router = Router()


@router.message(CommandStart())
async def start(message: Message):
    """
    Стартовая команда. Если ученик зарегистрирован, выводит доступные команды,
    если не зарегистрирован - выводит подсказку о команде /register.
    """
    if is_student_in_db(message.from_user.id):
        await message.answer("Привіт! Цей бот - Система Оперативного Взаємозв'язку з Адміністрацією, скорочено - СОВА.\nУ цьому боті можна комунікувати з представниками учнівського самоврядування та адміністрацією школи задля пропонування ідей, ставлення питань або звичайних повідомлень.\n/suggest - запропонувати ідею;\n/ask - поставити запитання;\n/message - надіслати повідомлення.")
    else:
        await message.answer("Привіт! Цей бот - Система Оперативного Взаємозв'язку з Адміністрацією, скорочено - СОВА.\nУ цьому боті можна комунікувати з представниками учнівського самоврядування та адміністрацією школи задля пропонування ідей, ставлення питань або звичайних повідомлень.\n\nДля початку роботи, вам треба пройти реєстрацію.Введіть команду /register")
