from aiogram import Router
from aiogram.filters import CommandStart
from aiogram.types import Message

from db.crud import StudentsDB

router = Router()
stud_db = StudentsDB()


@router.message(CommandStart())
async def start(message: Message):
    """
    Стартовая команда. Если ученик зарегистрирован, выводит доступные команды,
    если не зарегистрирован - выводит подсказку о команде /register.
    """
    if not stud_db.exists(message.from_user.id):
        await message.answer("Привіт! Цей бот - Система Оперативного Взаємозв'язку з Адміністрацією, скорочено - СОВА.\nУ цьому боті можна комунікувати з представниками учнівського самоврядування та адміністрацією школи задля пропонування ідей, ставлення питань або звичайних повідомлень.\n\nДля початку роботи, вам треба пройти реєстрацію. Введіть команду /register")
    elif not stud_db.is_registered(message.from_user.id):
        await message.answer("Привіт! Цей бот - Система Оперативного Взаємозв'язку з Адміністрацією, скорочено - СОВА.\nУ цьому боті можна комунікувати з представниками учнівського самоврядування та адміністрацією школи задля пропонування ідей, ставлення питань або звичайних повідомлень.\n\nВаша заявка проходить етап верифікації. У випадку довготривалого очікування проходження верифікації, зверніться до старости вашого класу.")
    else:
        await message.answer("Привіт! Цей бот - Система Оперативного Взаємозв'язку з Адміністрацією, скорочено - СОВА.\nУ цьому боті можна комунікувати з представниками учнівського самоврядування та адміністрацією школи задля пропонування ідей, ставлення питань або звичайних повідомлень.\n/suggest - запропонувати ідею;\n/ask - поставити запитання;\n/message - надіслати повідомлення.")

